<template>
  <div class="final-report-wrap">
    <main-button>Сохранить в PDF</main-button>
    <div class="final-report-content">
      <h1 class="title">Система потенциалов человека (СПЧ)</h1>
      <p>
        <strong
          >В использовании своих потенциалов нужно учитывать правило: 60 - 30 -
          10.</strong
        >
        В течение дня, недели, месяца, года нужно использовать свои потенциалы в
        такой пропорции:
      </p>
      <p>
        На сильные потенциалы <strong>1 ряда</strong> (работа и развитие,
        обучение по ним) - выделять 60 процентов своего времени бодрствования.
        Если вы будете расходовать больше времени, то будете выгорать, болеть и
        ломаться, откатываться по финансовым уровням вниз. Если меньше времени -
        то жизнь будет течь очень вяло, энергия застаиваться и опять же вылезать
        болезнями, апатией, депрессией и другими расстройствами тела и психики.
      </p>

      <p>
        Потенциалам вдохновения <strong>2 ряда</strong> следует уделять 30
        процентов времени дня, недели, месяца, года, не больше. Если вы слишком
        много функционируете по вашему вдохновению, то будет начинаться резкий
        слив энергии, сильнейшая слабость, а также будут появляться дыры в
        доходе и долги. Если слишком мало, то организм постоянно будет
        функционировать в ограниченном режиме - с быстрой утомляемостью и
        синдромом вечной усталости. Если вы достаточно заряжаетесь по второму
        ряду, то будете ощущать себя вдохновленными и ресурсными, с полной
        зарядкой своей внутренней батареи, кучей идей и новых возможностей для
        развития своих сил.
      </p>

      <p>
        На слабые потенциалы <strong>3 ряда</strong> нужно выделять максимум 10
        процентов своего времени - на то, чтобы делегировать нужному
        подрядчику/партнеру нужные процессы, не больше. Это наши слепые зоны
        развития и их должны закрывать другие люди (в любой сфере: в
        деятельности или дома).
      </p>

      <h3 class="subtitle">Описание 1 ряда:</h3>
      <p>
        <strong>1 ПОТЕНЦИАЛ</strong> – ваша уникальность/экспертность. Через
        данный потенциал человек воспринимает, понимает и анализирует мир,
        запоминает информацию, может понимать, чего действительно хочет – ваша
        Интуиция.
      </p>
      <p>* Сюда будет вставлен текст *</p>

      <p>
        <strong>2 ПОТЕНЦИАЛ</strong> – это ваше творчество (действия для себя
        после того, как проанализировали Первым потенциалом), основная
        внутренняя мотивация для достижения цели (миссия) + то каким вас
        воспринимают и видят другие люди – ваш имидж (включая стиль одежды).
        Через 2 Потенциал можно понять, как правильно выстраивать свое
        позиционирование, продвижение, через него человек становится популярным
        и именно через него определяют в какой сфере лучше выбрать свою
        профессию.
      </p>
      <p>* Сюда будет вставлен текст *</p>

      <p>
        <strong>3 ПОТЕНЦИАЛ</strong> – инструмент (навыки), с помощью которого
        человек достигает своих целей наиболее быстро и эффективно. Ключ,
        который открывает двери на пути к его цели, через который он может
        помогать другим людям открывать какие-то двери к их целям. Это то, что
        человек непосредственно делает, чтобы достичь цели по Второму
        потенциалу.
      </p>
      <p>* Сюда будет вставлен текст *</p>

      <h3 class="subtitle">Описание 2 ряда:</h3>
      <p>
        Целевая аудитория (ЦА) = ваш потенциальный клиент (запросы, с которыми
        приходят клиенты) и наполнение (хобби)
      </p>
      <p>
        <strong>4 ПОТЕНЦИАЛ</strong> – это боль/проблема вашего клиента, которую
        он может даже не осознавать.
      </p>
      <p>* Сюда будет вставлен текст *</p>

      <p>
        <strong>5 ПОТЕНЦИАЛ</strong> – отвечает за то, с какой целью к вам
        приходят люди/клиенты (какой у них запрос)
      </p>
      <p>* Сюда будет вставлен текст *</p>

      <p>
        <strong>6 ПОТЕНЦИАЛ</strong> – отвечает за результат, который получают
        Клиенты после взаимодействия с вами.
      </p>
      <p>* Сюда будет вставлен текст *</p>

      <p>
        <strong>Наполнение хобби</strong> – для достижения целей отдых так же
        важен, как и действия по потенциалам силы (30 % для второго ряда) и есть
        такая особенность, что тот потенциал, который находится во 2-м ряду, он
        наполняет тот потенциал, который находится над ним в 1-м ряду. Второй
        ряд потенциалов – это наш «бензин» для достижения целей и нужно по нему
        обязательно наполняться, вкладывать свои деньги, силы и время в это
        наполнение. Потому что, наполняясь по второму ряду, мы получаем энергию,
        возможности, ресурсы, а с помощью первого ряда потенциалов, мы реализуем
        пришедшие в нашу жизнь возможности и ресурсы для создания ценности.
      </p>

      <p>
        <strong>4 ПОТЕНЦИАЛ</strong> – хобби восприятия (то, что человек любит
        воспринимать/анализировать) - какую узкую проблему вы настроены
        анализировать своим каналом восприятия в качестве хобби + как отдыхать
        от своего главного канала восприятия/анализа, используемого в
        деятельности, - 1 потенциала, куда переключить свое восприятие чтобы
        восстановиться/наполниться.
      </p>
      <p>* Сюда будет вставлен текст *</p>

      <p>
        <strong>5 ПОТЕНЦИАЛ</strong> – творческое хобби (в одиночестве),
        действия человека; то, что он любит делать именно для себя, а не других,
        чтобы получить вдохновение для основной цели по 2-му потенциалу
      </p>
      <p>* Сюда будет вставлен текст *</p>

      <p>
        <strong>6 ПОТЕНЦИАЛ</strong> – коллективное хобби с друзьями (вторичный
        инструмент) – отдых от инструмента в деятельности (3-ий потенциал):
      </p>
      <p>* Сюда будет вставлен текст *</p>

      <h3 class="subtitle">Описание 3 ряда:</h3>
      <p>
        Слабые качества (действия), которые необходимо делегировать, у вас это:
      </p>

      <p>
        <strong>7 ПОТЕНЦИАЛ</strong>
      </p>
      <p>* Сюда будет вставлен текст *</p>

      <p>
        <strong>8 ПОТЕНЦИАЛ</strong>
      </p>
      <p>* Сюда будет вставлен текст *</p>

      <p>
        <strong>9 ПОТЕНЦИАЛ</strong>
      </p>
      <p>* Сюда будет вставлен текст *</p>
    </div>
    <main-button>Сохранить в PDF</main-button>
  </div>
</template>

<script>
import MainButton from "./MainButton.vue";

export default {
  name: "final-report",
};
</script>

<style scoped>
h3 {
  text-decoration: underline;
}

p {
  margin-bottom: 20px;
}

.final-report-wrap {
  padding: 30px 0;
  margin: 0 auto;
  display: flex;
  gap: 30px;
  flex-direction: column;
  align-items: center;
}

.final-report-content {
  margin: 0 auto;
  padding: 60px 90px;
  width: 1200px;
  background: rgb(248, 248, 248);
}

.title {
  margin-bottom: 30px;
}

.subtitle {
  margin-top: 50px;
  margin-bottom: 20px;
}
</style>
